
let ContractErrCode = {
    40001: '账户地址不能为空地址!',
    40002: '合同上租客已经欠租,请尽快通知租客交租!',
    40003: '参数租客地址与合同租客地址不相等!',
    40004: '房东终止合同失败:租客实际缴租金 + 保证金 < 应缴纳租金!',
    40005: '租客终止合同失败:租客实际缴租金 < 应缴纳租金 + 2个月租金!',
    40006: '参数房东地址与合同房东地址不相等',
    40007: '账户地址不能是空地址!',
    40008: "账户月不足以支付money!",
    // 40009: "预存money必须 ==合同租金 +合同保证金!",
    40010: "",
    40011: "签署合同不存在",
    40012: "签署合同已经过了签署时间!",
    40013: "这个Person account 不存在!",
    40014: "调用者必须是房东角色!",
    40015: "调用者必须是租客角色!",
    40016: "调用者必须是管理员!",
}